#-*-coding:utf-8 -*-
fg='————————————————————————————————\n'
f_g='································\n'
rooms = {
    "门厅": {
        "name": "门厅",
        "text": "你身处古堡的阴暗⻔厅。头顶⼀盏布满蜘蛛⽹的吊灯微微摇晃，投下忽明忽暗的光芒。空⽓中弥漫着潮湿的霉味，脚下是冰冷的⼤理⽯地⾯。北⾯是⼀扇沉重的橡⽊⻔，⻔上雕刻着狰狞的怪兽头像，西⾯则是⼀条通向⿊暗深处的⾛廊。",
        "exits": {"north": "大厅", "east": "走廊"},
        "item": {"纸条": "⼀张陈旧的纸条，似乎是从某本书⻚上撕下来的，上⾯潦草地写着‘光芒指引⽅向’。"}
    },
    "大厅":{
        "name": "大厅",
        "text": "你推开橡⽊⻔，进⼊了古堡的宏伟的⼤厅。尽管岁⽉流逝，依稀可⻅昔⽇的辉煌。⼀个巨⼤的⽔晶吊灯（虽然已经缺了⼏盏灯泡）仍然悬挂在⾼耸的天花板上。彩⾊玻璃窗阻挡了外界的光线，使得⼤厅内光线昏暗。南⾯是你进来的⻔厅，⻄⾯是⼀扇装饰华丽的⽊⻔，通往图书馆，西⾯则是⼀道拱形⽯⻔，通向餐厅。",
        "exits": {"south": "门厅", "west": "图书馆","east": "餐厅"},
        "item": {"拔火棍": "⼀根沉重的铁制拨⽕棍，顶端装饰着狮⼦头。"}
    },
    "走廊":{
        "name": "走廊",
        "text": "你沿着昏暗的⾛廊前⾏，脚踩在吱吱作响的⽊地板上。墙壁上挂着褪⾊的家族画像，画像中的⼈物表情模糊不清，仿佛在注视着你。⾛廊尽头似乎传来微弱的滴⽔声。⻄⾯是⻔厅。",
        "exits": {"west": "门厅"},
        "item": {"生锈的铁钥匙": "⼀把锈迹斑斑的铁钥匙，看起来年代久远，也许能打开古堡的某扇⻔。"},
    },
    "图书馆":{
        "name": "图书馆",
        "text": "你推开装饰华丽的⽊⻔，⾛进了布满灰尘的图书馆。⾼耸的书架⼀直延伸到天花板，上⾯堆满了布满灰尘的书籍。空⽓中弥漫着浓重的旧书和⽪⾰的味道，令⼈昏昏欲睡。阳光透过⾼窗洒进来，照亮了书架上零星散落的⾦箔，西⾯是通往⼤厅的⽊⻔。",
        "exits": {"east": "大厅"},
        "item": {"古书": "⼀本⽪⾯精装的古书，书⻚已经泛⻩，封⾯上⽤难以辨认的⽂字写着书名。翻开书⻚，⾥⾯似乎是关于古堡历史的记载。"}
    },
    "餐厅":{
        "name": "餐厅",
        "text": "你穿过拱形⽯⻔，来到了宽敞的餐厅。⻓⻓的橡⽊餐桌上布满了厚厚的灰尘，锈迹斑斑的银质餐具散落在桌⾯上，仿佛⼀场盛宴突然中断。墙壁上挂着巨⼤的狩猎场景油画，画布已经开始剥落。⻄⾯是通往⼤厅的拱形⽯⻔，北⾯是⼀扇破旧的⽊⻔，通向厨房。",
        "exits": {"west": "大厅", "north": "厨房"},
        "item": {"烛台": "⼀个精致的银⾊烛台，上⾯镶嵌着⼀些宝⽯，但⼤部分已经脱落。"}
    },
    "厨房":{
        "name": "厨房",
        "text": "你推开破旧的⽊⻔，进⼊了阴冷潮湿的厨房。腐烂的⽓味扑⿐⽽来，令⼈作呕。⽣锈的厨具散落在各处，巨⼤的壁炉已经冰冷，炉膛⾥堆满了⿊⾊的灰烬。南⾯是餐厅。地板中央，你注意到⼀块不寻常的⽊板，似乎可以移动，也许是⼀个隐蔽的活板⻔，通往地下。",
        "exits": {"south": "餐厅", "down": "地下通道"},
        "item": {"火柴": "⼀盒潮湿的⽕柴，看起来还能⽤，也许可以点燃什么。",
                  "水桶": "⼀个破旧的⽊⽔桶，⾥⾯积满了浑浊的⾬⽔。"}
    }
}

def h_look(room):
    print(f"{fg}{fg}你身处：{room}\n{f_g}{rooms[room]['text']}")
    if not rooms[room]["item"]:             
        print(f"{f_g}房间内不存在物品！")         
    else:
        print(f"{f_g}房间⾥有：")
        for i in rooms[room]['item']:
            print(i+':',rooms[room]['item'][i])
    print(f"{f_g}你可以向以下⽅向移动：")
    for i in rooms[room]['exits']:
        print(i+':',rooms[room]['exits'][i])
    return fg

def helps(room,bag):
    #help反馈
    T=True
    print(f'{fg}"help": "显示帮助信息 (指令列表)。"\n"look": "查看当前房间的详细描述。"\n"go": "向指定⽅向移动(例如: north,south,east,west, own)。"\n"take": "拾取房间内的物品。"\n"inventory": "查看背包中的物品。"\n"quit"或"exit": "退出游戏。"')
    i=input(f'{fg}/')
    if i=="look":
        #look帮助
        h_look(room)
    elif i=="go":
        print("请输入go [方向]!\n(例：go north)")
    elif i=="take":
        print("请输入take [物品]!")
    elif i=="inventory":
        if not bag:
            print("空空如也！")
        else:
            print("=======================\n你背包里有：")
            for i in bag:
                print(i)
    elif i=="quit" or i=='exit':
        T=False
        print("游戏结束！")
    else:
        print("指令有误！")
    return T

 

    



    


